11. Load a CSV file into a Pandas DataFrame and display the first 10 rows.

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("used_cars.csv")

In [4]:
df.head(10)

,brand,model,model_year,milage,fuel_type,engine,transmission,ext_col,int_col,accident,clean_title,price
0,Ford,Utility Police Interceptor Base,2013,"51,000 mi.",E85 Flex Fuel,300.0HP 3.7L V6 Cylinder Engine Flex Fuel Capa...,6-Speed A/T,Black,Black,At least 1 accident or damage reported,Yes,"$10,300"
1,Hyundai,Palisade SEL,2021,"34,742 mi.",Gasoline,3.8L V6 24V GDI DOHC,8-Speed Automatic,Moonlight Cloud,Gray,At least 1 accident or damage reported,Yes,"$38,005"
2,Lexus,RX 350 RX 350,2022,"22,372 mi.",Gasoline,3.5 Liter DOHC,Automatic,Blue,Black,None reported,NaN,"$54,598"
3,INFINITI,Q50 Hybrid Sport,2015,"88,900 mi.",Hybrid,354.0HP 3.5L V6 Cylinder Engine Gas/Electric H...,7-Speed A/T,Black,Black,None reported,Yes,"$15,500"
4,Audi,Q3 45 S line Premium Plus,2021,"9,835 mi.",Gasoline,2.0L I4 16V GDI DOHC Turbo,8-Speed Automatic,Glacier White Metallic,Black,None reported,NaN,"$34,999"
5,Acura,ILX 2.4L,2016,"136,397 mi.",Gasoline,2.4 Liter,F,Silver,Ebony.,None reported,NaN,"$14,798"
6,Audi,S3 2.0T Premium Plus,2017,"84,000 mi.",Gasoline,292.0HP 2.0L 4 Cylinder Engine Gasoline Fuel,6-Speed A/T,Blue,Black,None reported,Yes,"$31,000"
7,BMW,740 iL,2001,"242,000 mi.",Gasoline,282.0HP 4.4L 8 Cylinder Engine Gasoline Fuel,A/T,Green,Green,None reported,Yes,"$7,300"
8,Lexus,RC 350 F Sport,2021,"23,436 mi.",Gasoline,311.0HP 3.5L V6 Cylinder Engine Gasoline Fuel,6-Speed A/T,Black,Black,None reported,Yes,"$41,927"
9,Tesla,Model X Long Range Plus,2020,"34,000 mi.",NaN,534.0HP Electric Motor Electric Fuel System,A/T,Black,Black,None reported,Yes,"$69,950"

12. Perform groupby operations on a dataset to find the mean and sum of numerical columns
based on a categorical column.

In [5]:
df["price"] = (
    df["price"]
    .str.replace("$", "", regex=False)
    .str.replace(",", "", regex=False)
    .astype(float)
)

In [6]:
df.groupby("brand")["price"].sum()

brand
Acura             1794181.0
Alfa               716035.0
Aston             1036796.0
Audi              7981486.0
BMW              15402116.0
Bentley           4539267.0
Bugatti           1950995.0
Buick              610730.0
Cadillac          4458768.0
Chevrolet        10723040.0
Chrysler           386758.0
Dodge             3105049.0
FIAT                73998.0
Ferrari           2925488.0
Ford             13988980.0
GMC               3414837.0
Genesis            865598.0
Honda             1383419.0
Hummer             313889.0
Hyundai           1364175.0
INFINITI          1352731.0
Jaguar            1521048.0
Jeep              4447270.0
Karma              106500.0
Kia               2135328.0
Lamborghini       7572080.0
Land              7249328.0
Lexus             5813969.0
Lincoln           1473206.0
Lotus              219250.0
Lucid              305899.0
MINI               467202.0
Maserati          4779806.0
Maybach             64250.0
Mazda             1280708.0
McLaren           1280745.0
Mercedes-Benz    16403866.0
Mercury             42700.0
Mitsubishi         351013.0
Nissan            3004994.0
Plymouth            28500.0
Polestar            35999.0
Pontiac            203594.0
Porsche          17839011.0
RAM               3915654.0
Rivian            1583349.0
Rolls-Royce       4080920.0
Saab                20450.0
Saturn              61895.0
Scion               52993.0
Subaru            1375690.0
Suzuki               6900.0
Tesla             4214234.0
Toyota            5975174.0
Volkswagen        1302010.0
Volvo             1004869.0
smart                5000.0
Name: price, dtype: float64

In [7]:
df.groupby("brand")["price"].mean()

brand
Acura            2.803408e+04
Alfa             3.768605e+04
Aston            1.151996e+05
Audi             3.990743e+04
BMW              4.107231e+04
Bentley          1.375535e+05
Bugatti          1.950995e+06
Buick            2.035767e+04
Cadillac         4.167073e+04
Chevrolet        3.672274e+04
Chrysler         1.381279e+04
Dodge            3.450054e+04
FIAT             1.479960e+04
Ferrari          2.437907e+05
Ford             3.624088e+04
GMC              3.752568e+04
Genesis          4.327990e+04
Honda            2.195903e+04
Hummer           1.961806e+04
Hyundai          1.894688e+04
INFINITI         2.292764e+04
Jaguar           3.236272e+04
Jeep             3.109979e+04
Karma            5.325000e+04
Kia              2.809642e+04
Lamborghini      2.912338e+05
Land             5.576406e+04
Lexus            3.566852e+04
Lincoln          2.833088e+04
Lotus            5.481250e+04
Lucid            1.019663e+05
MINI             1.415764e+04
Maserati         1.405825e+05
Maybach          6.425000e+04
Mazda            2.001106e+04
McLaren          2.134575e+05
Mercedes-Benz    5.207577e+04
Mercury          1.423333e+04
Mitsubishi       1.755065e+04
Nissan           2.590512e+04
Plymouth         2.850000e+04
Polestar         3.599900e+04
Pontiac          1.357293e+04
Porsche          8.875130e+04
RAM              4.302916e+04
Rivian           9.313818e+04
Rolls-Royce      3.709927e+05
Saab             1.022500e+04
Saturn           1.237900e+04
Scion            8.832167e+03
Subaru           2.149516e+04
Suzuki           6.900000e+03
Tesla            4.843947e+04
Toyota           3.002600e+04
Volkswagen       2.206797e+04
Volvo            2.644392e+04
smart            5.000000e+03
Name: price, dtype: float64

13. Handle missing data in a DataFrame by replacing NaN values with the column mean.

In [8]:
df.head(3)

,brand,model,model_year,milage,fuel_type,engine,transmission,ext_col,int_col,accident,clean_title,price
0,Ford,Utility Police Interceptor Base,2013,"51,000 mi.",E85 Flex Fuel,300.0HP 3.7L V6 Cylinder Engine Flex Fuel Capa...,6-Speed A/T,Black,Black,At least 1 accident or damage reported,Yes,10300.0
1,Hyundai,Palisade SEL,2021,"34,742 mi.",Gasoline,3.8L V6 24V GDI DOHC,8-Speed Automatic,Moonlight Cloud,Gray,At least 1 accident or damage reported,Yes,38005.0
2,Lexus,RX 350 RX 350,2022,"22,372 mi.",Gasoline,3.5 Liter DOHC,Automatic,Blue,Black,None reported,NaN,54598.0

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4009 entries, 0 to 4008
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   brand         4009 non-null   object
 1   model         4009 non-null   object
 2   model_year    4009 non-null   int64
 3   milage        4009 non-null   object
 4   fuel_type     3839 non-null   object
 5   engine        4009 non-null   object
 6   transmission  4009 non-null   object
 7   ext_col       4009 non-null   object
 8   int_col       4009 non-null   object
 9   accident      3896 non-null   object
 10  clean_title   3413 non-null   object
 11  price         4009 non-null   float64
dtypes: float64(1), int64(1), object(10)
memory usage: 376.0+ KB

In [10]:
df["fuel_type"] = df["fuel_type"].fillna(df["fuel_type"].mode()[0])
df["fuel_type"]

0       E85 Flex Fuel
1            Gasoline
2            Gasoline
3              Hybrid
4            Gasoline
            ...
4004         Gasoline
4005         Gasoline
4006         Gasoline
4007         Gasoline
4008         Gasoline
Name: fuel_type, Length: 4009, dtype: object

14. Merge two DataFrames on a common key and perform an inner, outer, left, and right join.

In [11]:


df1 = pd.DataFrame({
    "id": [1, 2, 3],
    "name": ["Alice", "Bob", "Charlie"]
})

df2 = pd.DataFrame({
    "id": [1, 2, 4],
    "score": [85, 90, 95]
})

In [15]:
merged_df = pd.merge(df1, df2, on="id", how="outer")

In [16]:
merged_df

   id     name  score
0   1    Alice   85.0
1   2      Bob   90.0
2   3  Charlie    NaN
3   4      NaN   95.0

In [17]:
merged_df2 = pd.merge(df1, df2, on="id", how="outer")
merged_df2

   id     name  score
0   1    Alice   85.0
1   2      Bob   90.0
2   3  Charlie    NaN
3   4      NaN   95.0

In [20]:
merged_df3 = pd.merge(df1, df2, on="id", how="left")
merged_df3

   id     name  score
0   1    Alice   85.0
1   2      Bob   90.0
2   3  Charlie    NaN

In [21]:
merged_df4 = pd.merge(df1, df2, on="id", how="right")
merged_df4

   id   name  score
0   1  Alice     85
1   2    Bob     90
2   4    NaN     95

15. Convert a column of object type into a float type and handle any errors that occur during
conversion.

In [23]:
df["milage"] = df["milage"].str.replace("mi.","",regex=False).str.replace(",","",regex=False).astype(float)

In [24]:
df.head(3)

,brand,model,model_year,milage,fuel_type,engine,transmission,ext_col,int_col,accident,clean_title,price
0,Ford,Utility Police Interceptor Base,2013,51000.0,E85 Flex Fuel,300.0HP 3.7L V6 Cylinder Engine Flex Fuel Capa...,6-Speed A/T,Black,Black,At least 1 accident or damage reported,Yes,10300.0
1,Hyundai,Palisade SEL,2021,34742.0,Gasoline,3.8L V6 24V GDI DOHC,8-Speed Automatic,Moonlight Cloud,Gray,At least 1 accident or damage reported,Yes,38005.0
2,Lexus,RX 350 RX 350,2022,22372.0,Gasoline,3.5 Liter DOHC,Automatic,Blue,Black,None reported,NaN,54598.0

16. Filter a DataFrame to select rows where a specific column's values fall within a given range.

In [30]:
df[df["model_year"] == 2006].head(3)

,brand,model,model_year,milage,fuel_type,engine,transmission,ext_col,int_col,accident,clean_title,price
31,Dodge,Ram 1500 Laramie Mega Cab,2006,300183.0,Gasoline,345.0HP 5.7L 8 Cylinder Engine Gasoline Fuel,A/T,Silver,Gray,At least 1 accident or damage reported,Yes,10900.0
70,Chrysler,300C SRT8,2006,43000.0,Gasoline,425.0HP 6.1L 8 Cylinder Engine Gasoline Fuel,5-Speed A/T,Silver,Black,At least 1 accident or damage reported,Yes,19995.0
135,Land,Rover LR3 HSE,2006,153843.0,Gasoline,300.0HP 4.4L 8 Cylinder Engine Gasoline Fuel,6-Speed A/T,Red,Beige,At least 1 accident or damage reported,Yes,9950.0